Revit 2027 API
IExportContext2D.OnElementEnd2D Method
 This method marks the end of an element being exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnElementEnd2D(
	ElementNode node
)
Sub OnElementEnd2D (
	node As ElementNode
)
void OnElementEnd2D(
	ElementNode^ node
)
abstract OnElementEnd2D :
        node : ElementNode -> unit
Parameters
node ElementNode
 An output node that represents an element.
Remarks
 For views having non-Wireframe display style, geometry of elements is output outside of view, instance and link begin/end brackets. Therefore the argument to this method is ElementNode that has both element ID and the host document.
See Also
Reference
IExportContext2D Interface
Autodesk.Revit.DB Namespace